<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class Main extends Model
{
    public static $about = [
        [
            'icon' => 'individual',
            'name' => 'Індивідуальність',
            'description' => 'Окремий та індивідуальний підхід для кожного нашого покупця',
        ],
        [
            'icon' => 'money',
            'name' => 'Вигоду',
            'description' => 'Найвигідніші для Вас умови співпраці. Ми зацікавлені в цьому',
        ],
        [
            'icon' => 'handshake',
            'name' => 'Зручність',
            'description' => 'Обговорена грошова виплата в зручний для Вас час та спосіб',
        ],
        [
            'icon' => 'fast-money',
            'name' => 'Швидкість',
            'description' => 'Моментальна оплата після оцінки та відправки Вашой шевелюри',
        ],
        [
            'icon' => 'info',
            'name' => 'Інформативність',
            'description' => 'Відправляйте по вайберу фото волосся і спеціаліст оголосить ціну',
        ],
        [
            'icon' => 'style',
            'name' => 'Стиль',
            'description' => 'Ми запропонуємо Вам стильну та модну стрижку в подарунок',
        ],
    ];

    public static $accordion = [
        [
            'heading' => 'Миття волосся',
            'icon' => 'washing',
            'content' => 'Попередньо необхідно вимити волосся шампунем, яким Ви зазвичай користуєтесь.',
        ],
        [
            'heading' => 'Сушка волосся',
            'icon' => 'dry',
            'content' => 'Просушити волосся без використання фена, дайте локонам висохнути природним шляхом.',
        ],
        [
            'heading' => 'Розчісування',
            'icon' => 'hairdresser',
            'content' => 'Розчесати пасма, щоб позбутися ковтунів (якщо такі є), також, запобігти подальшому заплутування.',
        ],
        [
            'heading' => 'Поділ волосся',
            'icon' => 'bunch',
            'content' => 'Розділити волосся на кілька пасів, обмотавши кілька разів, туго перетягнути кожну гумкою.',
        ],
        [
            'heading' => 'Зріз волосся',
            'icon' => 'cutting',
            'content' => 'Зробити зріз, відступивши кілька сантиметрів трохи вище кріплення та заплітаємо зрізане волосся в косу.',
        ],
        [
            'heading' => 'Оцінка волосся',
            'icon' => 'hair-info',
            'content' => 'Зважити зріз та сфотографувати біля сантиметра і надіслати дані для оцінювання.',
        ],
    ];
}
